tutorials/dnsFoam/boxTurb16/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (16 16 16) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    cyclic patch0 
    (
        (0 3 2 1)
        (4 5 6 7)
    )
    cyclic patch1 
    (
        (0 4 7 3)
        (2 6 5 1)
    )
    cyclic patch2 
    (
        (3 7 6 2)
        (1 5 4 0)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
