tutorials/dnsFoam/boxTurb16/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    object      boundary;
    location    "constant/polyMesh";
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    patch0
    {
        type            cyclic;
        physicalType    cyclic;
        nFaces          512;
        startFace       11520;
        featureCos      0.9;
    }
    patch1
    {
        type            cyclic;
        physicalType    cyclic;
        nFaces          512;
        startFace       12032;
        featureCos      0.9;
    }
    patch2
    {
        type            cyclic;
        physicalType    cyclic;
        nFaces          512;
        startFace       12544;
        featureCos      0.9;
    }
)

// ************************************************************************* //
